[
  {
    "id": 1,
    "title": "Skillora",
    "image": "https://i.ibb.co/XP8jC9j/skillora.png",
    "features": [
      "Service Discovery & Booking: Browse and filter local services by category and area, with easy calendar-based booking.",
      "Provider Profiles & Listings: Users can offer their own services with detailed profiles, descriptions, and availability management.",
      "Notification: Real time notification system."
    ],
    "techStack": ["React", "Vite", "Tailwind CSS", "Firebase", "MongoDB"],
    "live": "https://skillora-11.web.app/",
    "source": "https://github.com/tanmayislam2006/skillora.git",
    "description": "Skillora is a modern platform for discovering, sharing, and managing skills and services. Users can offer their own services, book others’ services with built-in scheduling, and connect through detailed provider profiles. It includes secure authentication, theme toggling, and a responsive design that ensures a smooth experience across devices."
  },
  {
    "id": 2,
    "title": "Green Connect",
    "image": "https://i.ibb.co/qLh79CX1/green-connect.png",
    "features": [
      "Community Gardening Tips: Browse and share expert advice on sustainable gardening, filtered by category and difficulty.",
      "Gardener Profiles: Explore other users’ profiles to see their contributions, favorite tips, and connect with local gardeners.",
      "Dashboard: Manage shared tips, update, and check all status."
    ],
    "techStack": ["React", "Vite", "Tailwind CSS", "Firebase", "MongoDB"],
    "live": "https://green-connect-app.web.app/",
    "source": "https://github.com/tanmayislam2006/Green-Connect.git",
    "description": "Green Connect is a modern community platform for sustainable gardening. Users can share their tips, discover new techniques, and build local networks of fellow gardeners. With Firebase authentication, a responsive design, and rich interactive features, it aims to inspire eco-friendly living and knowledge-sharing among users of all experience levels."
  },
  {
    "id": 3,
    "title": "FOODCart",
    "image": "https://i.ibb.co/JRSXxZnx/foodcart.png",
    "features": [
      "Dynamic Menu with Categories: Browse food items by type (Breakfast, Lunch, Dinner) with intuitive filtering and pagination.",
      "Role-Based Access: Customers and admins have dedicated views with JWT-secured authentication and protected routes.",
      "Order Management Dashboard: Admin panel for managing menu items, tracking orders, and controlling user roles."
    ],
    "techStack": [
      "React",
      "Node.js",
      "Express",
      "MongoDB",
      "JWT",
      "Firebase",
      "Tailwind CSS"
    ],
    "live": "#",
    "source": "https://github.com/tanmayislam2006/foodcart-client.git",
    "description": "FOODCart is a full-stack restaurant management and ordering platform that offers customers an easy way to browse, select, and order meals while providing admins with a powerful dashboard to manage menu items and track orders. It features role-based access, secure authentication with JWT, and a clean, responsive design."
  }
]